[
  {
    "name": "html5",
    "data": {
      "title": "HTML5",
      "icon": "Html5Icon",
      "color": "#F16529",
      "variant": "success",
      "status": "Mastered",
      "desc": "HTML5 is a markup language used for structuring and presenting content on the World Wide Web. It includes detailed processing models to encourage more interoperable implementations; it extends, improves and rationalizes the markup available for documents and introduces markup and application programming interfaces (APIs) for complex web applications. For the same reasons, HTML5 is also a candidate for cross-platform mobile applications, because it includes features designed with low-powered devices in mind.",
      "url": "https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/HTML5"
    }
  },
  {
    "name": "css3",
    "data": {
      "title": "CSS3",
      "icon": "Css3Icon",
      "color": "#0F5298",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language such as HTML. CSS is designed to enable the separation of presentation and content, including layout, colors, and fonts. This separation can improve content accessibility, provide more flexibility and control in the specification of presentation characteristics, enable multiple web pages to share formatting by specifying the relevant CSS in a separate .css file which reduces complexity and repetition in the structural content as well as enabling the .css file to be cached to improve the page load speed between the pages that share the file and its formatting. ",
      "url": "https://developer.mozilla.org/en-US/docs/Web/CSS"
    }
  },
  {
    "name": "js",
    "data": {
      "title": "JavaScript",
      "icon": "JavaScriptIcon",
      "color": "#FDC72E",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "Javascript is an object-oriented scripting language. Alongside HTML and CSS, JavaScript is one of the core technologies of the World Wide Web. JavaScript enables interactive web pages and is an essential part of web applications. The vast majority of websites use it for client-side page behavior, and all major web browsers have a dedicated JavaScript engine to execute it.",
      "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
    }
  },
  {
    "name": "scss",
    "data": {
      "title": "SCSS",
      "icon": "SassIcon",
      "color": "#CD6799",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "Sass is a preprocessor scripting language that is interpreted or compiled into CSS. Sass (in the larger context of both syntaxes) extends CSS by providing several mechanisms available in more traditional programming languages, particularly object-oriented languages, but that are not available to CSS3 itself. When SassScript is interpreted, it creates blocks of CSS rules for various selectors as defined by the Sass file. The Sass interpreter translates SassScript into CSS.",
      "url": "https://sass-lang.com/"
    }
  },
  {
    "name": "php",
    "data": {
      "title": "PHP",
      "icon": "PhpIcon",
      "color": "#474A8A",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "PHP is a general-purpose scripting language especially suited to web development. PHP code is usually processed on a web server by a PHP interpreter implemented as a module, a daemon or as a Common Gateway Interface (CGI) executable. On a web server, the result of the interpreted and executed PHP code – which may be any type of data, such as generated HTML or binary image data – would form the whole or part of an HTTP response.",
      "url": "https://www.php.net/"
    }
  },
  {
    "name": "mysql",
    "data": {
      "title": "MySQL",
      "icon": "MySqlIcon",
      "color": "#00758F",
      "variant": "success",
      "status": "Basic knowledge",
      "desc": "MySQL is an open-source relational database management system. It organizes data into one or more data tables in which data types may be related to each other; these relations help structure the data. SQL is a language programmers use to create, modify and extract data from the relational database, as well as control user access to the database.",
      "url": "https://www.mysql.com/"
    }
  },
  {
    "name": "tailwindcss",
    "data": {
      "title": "Tailwind Css",
      "icon": "TailwindCssIcon",
      "color": "#14b4c6",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "Tailwind CSS is a highly customizable, low-level CSS framework that gives you all of the building blocks you need to build bespoke designs without any annoying opinionated styles you have to fight to override.",
      "url": "https://tailwindcss.com/"
    }
  },
  {
    "name": "bootstrap",
    "data": {
      "title": "Bootstrap",
      "icon": "BootstrapIcon",
      "color": "#7952b3",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development. It contains CSS and (optionally) JavaScript-based design templates for typography, forms, buttons, navigation, and other interface components.",
      "url": "https://getbootstrap.com/"
    }
  },
  {
    "name": "ue4",
    "data": {
      "title": "Unreal Engine",
      "icon": "UnrealEngineIcon",
      "color": "#000",
      "variant": "success",
      "status": "Good knowledge",
      "desc": "The Unreal Engine is a game engine developed by Epic Games. Written in C++, its features a high degree of portability, supporting a wide range of platforms. It has been used in a variety of other genres, including platformers, fighting games, and MMORPGs, and has seen adoption by many non-gaming projects.",
      "url": "https://www.unrealengine.com/en-US/"
    }
  },
  {
    "name": "python",
    "data": {
      "title": "Python",
      "icon": "PythonIcon",
      "color": "#306998",
      "variant": "warning",
      "status": "Learning at high school",
      "desc": "Python is an interpreted, high-level and general-purpose programming language. Its language constructs and object-oriented approach aim to help programmers write clear, logical code for small and large-scale projects.",
      "url": "https://www.python.org/"
    }
  },
  {
    "name": "vuejs",
    "data": {
      "title": "Vue.js",
      "icon": "VueJsIcon",
      "color": "#41B883",
      "variant": "warning",
      "status": "Learning",
      "desc": "Vue is a progressive front-end javascript framework for building user interfaces. Unlike other monolithic frameworks, Vue is designed from the ground up to be incrementally adoptable.",
      "url": "https://vuejs.org/"
    }
  },
  {
    "name": "nuxtjs",
    "data": {
      "title": "Nuxt.js",
      "icon": "NuxtJsIcon",
      "color": "#41b883",
      "variant": "warning",
      "status": "Learning",
      "desc": "Nuxt.js is a free and open source web application framework based on Vue.js, Node.js, Webpack and Babel.js (inspired by Next.js). The framework is advertised as a \"meta-framework for universal applications\". It can be use to make Single Page Application (SPA), server-rendered web apps (SSR) or static websites.",
      "url": "https://nuxtjs.org/"
    }
  },
  {
    "name": "laravel",
    "data": {
      "title": "Laravel",
      "icon": "LaravelIcon",
      "color": "#F05340",
      "variant": "warning",
      "status": "Learning",
      "desc": "Laravel is a free, open-source PHP web framework intended for the development of web applications following the model–view–controller (MVC) architectural pattern and based on Symfony. Some of the features of Laravel are a modular packaging system with a dedicated dependency manager, different ways for accessing relational databases, utilities that aid in application deployment and maintenance, and its orientation toward syntactic sugar.",
      "url": "https://laravel.com/"
    }
  },
  {
    "name": "graphql",
    "data": {
      "title": "GraphQL",
      "icon": "GraphQlIcon",
      "color": "#e535ab",
      "variant": "warning",
      "status": "Learning",
      "desc": "GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.",
      "url": "https://graphql.org/"
    }
  },
  {
    "name": "git",
    "data": {
      "title": "Git",
      "icon": "GitIcon",
      "color": "#F1502F",
      "variant": "info",
      "status": "Used",
      "desc": "Git is a distributed version-control system for tracking changes in source code during software development. It is designed for coordinating work among programmers, but it can be used to track changes in any set of files.",
      "url": "https://git-scm.com/"
    }
  },
  {
    "name": "bitbucket",
    "data": {
      "title": "Bitbucket",
      "icon": "BitbucketIcon",
      "color": "#0D54C3",
      "variant": "info",
      "status": "Used",
      "desc": "Bitbucket is a web-based version control repository hosting service owned by Atlassian, for source code and development projects that use either Mercurial or Git revision control systems.",
      "url": "https://bitbucket.org/"
    }
  },
  {
    "name": "trello",
    "data": {
      "title": "Trello",
      "icon": "TrelloIcon",
      "color": "#007BCB",
      "variant": "info",
      "status": "Used",
      "desc": "Trello is a web-based Kanban-style list-making application which is a subsidiary of Atlassian.",
      "url": "https://trello.com/"
    }
  },
  {
    "name": "jekyll",
    "data": {
      "title": "Jekyll",
      "icon": "JekyllIcon",
      "color": "#c90000",
      "variant": "info",
      "status": "Tried",
      "desc": "Jekyll is a simple, blog-aware, static site generator for personal, project, or organization sites written in Ruby. Jekyll renders Markdown or Textile and Liquid templates, and produces a complete, static website ready to be served",
      "url": "https://jekyllrb.com/"
    }
  },
  {
    "name": "vscode",
    "data": {
      "title": "VS Code",
      "icon": "VisualStudioCodeIcon",
      "color": "#22a6f1",
      "variant": "info",
      "status": "Used",
      "desc": "Visual Studio Code is a free source-code editor. Features include support for debugging, syntax highlighting, intelligent code completion, snippets, code refactoring, and embedded Git.",
      "url": "https://code.visualstudio.com/"
    }
  },
  {
    "name": "sketchup",
    "data": {
      "title": "Sketchup",
      "icon": "SketchUpIcon",
      "color": "#f7162c",
      "variant": "success",
      "status": "Learned at secondary school",
      "desc": "SketchUp is a 3D modeling computer program for a wide range of drawing applications such as architectural, interior design, landscape architecture, civil and mechanical engineering, film and video game design.",
      "url": "https://www.sketchup.com/"
    }
  },
  {
    "name": "office",
    "data": {
      "title": "Office",
      "icon": "MicrosoftOfficeIcon",
      "color": "#DC3E15",
      "variant": "info",
      "status": "Used",
      "desc": "Microsoft Office is a family of client software, server software, and services. Includes Outlook, OneDrive, Word, Excel, PowerPoint, OneNote, SharePoint, Teams, and Yammer.",
      "url": "https://www.office.com/"
    }
  },
  {
    "name": "photoshop",
    "data": {
      "title": "Photoshop",
      "icon": "AdobePhotoshopIcon",
      "color": "#001d34",
      "variant": "success",
      "status": "Basic knowledge",
      "desc": "Adobe Photoshop is a raster graphics editor. It's an industry standard not only in raster graphics editing, but in digital art as a whole. Photoshop can edit and compose raster images in multiple layers and supports masks, alpha compositing and several color models including RGB, CMYK, CIELAB, spot color, and duotone.",
      "url": "https://www.adobe.com/products/photoshop.html"
    }
  },
  {
    "name": "musescore",
    "data": {
      "title": "Musescore",
      "icon": "MuseScoreIcon",
      "color": "#1f74bd",
      "variant": "success",
      "status": "Basic knowledge",
      "desc": "MuseScore is a scorewriter supporting a wide variety of file formats and input methods.",
      "url": "https://musescore.org/"
    }
  }
]
